Enterprise_Serivces/Cert/Bronze3/LoyaltyPointsService/result1/Iteration1/t4_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05/ILoyaltyPointsService/GetPointSubTypes</wsa:Action><wsa:MessageID>uuid:137dde37-17a5-4f32-ac83-46b743673363</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslloyaltyprogramservicesqa1.testgs.pvt/LoyaltyPointsService.svc</wsa:To></soap:Header><soap:Body><GetPointSubTypes xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><PointType xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2011/02">SalesTransaction</PointType></request></GetPointSubTypes></soap:Body></soap:Envelope>